# AllSegmentCurves Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurtainGridLine..::..AllSegmentCurves Property
CurtainGridLine Class See Also
---
Retrieve the curves of all segments.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CurveArray AllSegmentCurves { get; }
```

Visual Basic
---
```text
Public ReadOnly Property AllSegmentCurves As CurveArray
	Get
```

Visual C++
---
```text
public:
property CurveArray^ AllSegmentCurves {
	CurveArray^ get ();
}
```

# Remarks
User can get these curves and then call the method AddSegment() or RemoveSegment() to add/remove specified segments. If the specified segment is already added/removed, nothing will happen.
# See Also
CurtainGridLine Class
Autodesk.Revit.DB Namespace